cf_billing/Documents/бестНазначениеОтветственногоПИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестНазначениеОтветственногоПИР</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестОтветственныйПИР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПИР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтроений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргАбонентыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАбонентыПомещений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестОтветственныйПИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОтветственныйПИР</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/бестНазначениеОтветственногоПИР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
	
#Область РеализацияИнтерфейса_Проведение
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
		ПараметрыЗапроса  	= Новый Структура;
		Схема 				= Неопределено;
		
		ДобавитьТекстЗапросаОтветственныйПИР(Схема,Регистры);
		
		Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
			ВспомогательныеПараметры 	= Новый Структура;
			энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
		КонецЕсли;
		
		КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
		
		ПараметрыЗапроса 				= Новый Структура;
		ПараметрыЗапроса.Вставить("мДокументы",	ДокументСсылка);
		
		ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
		ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
		
	КонецПроцедуры
	
Процедура ДобавитьТекстЗапросаОтветственныйПИР(Схема, Регистры)
		
		ИмяРегистра = "бестОтветственныйПИР";
		
		Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
			Возврат;
		КонецЕсли;
		
		Если Схема = Неопределено Тогда
			Схема 	= Новый СхемаЗапроса;
			Пакет 	= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		КонецЕсли;
		
		Текст  		= 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бестНазначениеОтветственногоПИР.Дата КАК Период,
		|	бестНазначениеОтветственногоПИР.Организация КАК Организация,
		|	бестНазначениеОтветственногоПИР.Район КАК Район,
		|	бестНазначениеОтветственногоПИРСписокСтроений.КлючПомещения КАК КлючПомещения,
		|	бестНазначениеОтветственногоПИР.ОтветственныйПИР КАК Ответственный
		|ИЗ
		|	Документ.бестНазначениеОтветственногоПИР КАК бестНазначениеОтветственногоПИР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестНазначениеОтветственногоПИР.СписокСтроений КАК бестНазначениеОтветственногоПИРСписокСтроений
		|		ПО бестНазначениеОтветственногоПИР.Ссылка = бестНазначениеОтветственногоПИРСписокСтроений.Ссылка
		|			И (бестНазначениеОтветственногоПИР.Ссылка В (&мДокументы))
		|			И (бестНазначениеОтветственногоПИРСписокСтроений.Ссылка В (&мДокументы))";	
		
		Пакет.УстановитьТекстЗапроса(Текст);
		Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
		
	КонецПроцедуры
	
#КонецОбласти
	
#Область ЗаполнениеДанных

Процедура ЗаполнитьТаблицуДанными(СписокСтроений, Отборы) Экспорт 
	ДанныеДляЗаполнения = ПолучитьДанныеДляЗаполнения(Отборы);
	ДополнитьНовымиДанными(ДанныеДляЗаполнения, СписокСтроений, Отборы);
КонецПроцедуры

Процедура ДополнитьНовымиДанными(ДанныеДляЗаполнения, СписокСтроений, Отборы)
	ФильтрПоАдресу 				= ПолучитьФильтрПоАдресу(Отборы);
	ЕстьОтборПоАдресу 			= НЕ ФильтрПоАдресу.Количество() = 0;
	ЕстьЧисловыеДанныеАдреса 	= ПолучитьФильтрПоАдресу(Отборы);
	
	Выборка = ДанныеДляЗаполнения.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ЕстьОтборПоАдресу И ПолучитьПризнакПропускаСтроки(Выборка, ФильтрПоАдресу) Тогда 
			Продолжить;			
		КонецЕсли;
		
		НСтрока = СписокСтроений.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьПризнакПропускаСтроки(Выборка, ФильтрПоАдресу)
	ПропускатьСтроку		= Истина;
	АдресСтруктурой	 		= УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Выборка.АдресСтроенияJSON);
	Если АдресСтруктурой.Количество() = 0 Тогда 
		Возврат ПропускатьСтроку;
	КонецЕсли;	
	
	ЭтоАдресВСвободнойФорме	= УправлениеКонтактнойИнформациейКлиентСервер.ЭтоАдресВСвободнойФорме(АдресСтруктурой.addressType);	
	Улица 					= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФильтрПоАдресу, "Улица", Неопределено);
	ЕстьОтборПоУлице		= Ложь;
	Если НЕ Улица = Неопределено Тогда
		ЕстьОтборПоУлице	= Истина;
		
		Если ЭтоАдресВСвободнойФорме Тогда
			ПропускатьСтроку = СтрНайти(НРег(Выборка.АдресСтроенияJSON), НРег(Улица)) = 0;
		Иначе
			ПропускатьСтроку = СтрНайти(НРег(АдресСтруктурой.Street), НРег(Улица)) = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоАдресВСвободнойФорме ИЛИ (ЕстьОтборПоУлице И ПропускатьСтроку) Тогда
		// Нет необходимости проверять числовые значения у строки адреса
		Возврат ПропускатьСтроку;
	КонецЕсли;
	
	
	// Проверяем числовые значения по полученной структуре адреса
	НомерДома				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФильтрПоАдресу, "НомерДома", Неопределено);
	Если НЕ НомерДома = Неопределено Тогда
		ПропускатьСтроку = НЕ Строка(НомерДома) = АдресСтруктурой.houseNumber;	
		Если ПропускатьСтроку Тогда 
			Возврат ПропускатьСтроку;
		КонецЕсли;		
	КонецЕсли;
	
	НомерКвОт				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФильтрПоАдресу, "НомерКвОт", Неопределено);
	НомерКвДо				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФильтрПоАдресу, "НомерКвДо", Неопределено);
	Если НЕ НомерКвОт = Неопределено И НЕ НомерКвДо = Неопределено Тогда
		apartments = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(АдресСтруктурой, "apartments", Новый Массив);
		Если apartments.Количество() = 0 Тогда
			Возврат Истина;
		КонецЕсли;
		НомерКвартиры 		= Число(apartments[0].number);
		ПропускатьСтроку 	= НЕ (НомерКвартиры >= НомерКвОт И НомерКвартиры <= НомерКвДо);
	КонецЕсли;
	
	Возврат ПропускатьСтроку;
КонецФункции

#КонецОбласти

#Область ПолучениеДанныхДляЗаполнения

Функция ПолучитьДанныеДляЗаполнения(Отборы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргАбонентыПомещенийСрезПоследних.Организация КАК Организация,
	|	энргАбонентыПомещенийСрезПоследних.Район КАК Район,
	|	энргАбонентыПомещенийСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ АбонентыПомещения
	|ИЗ
	|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргАбонентыПомещенийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АбонентыПомещения.Организация КАК Организация,
	|	АбонентыПомещения.Район КАК Район,
	|	АбонентыПомещения.КлючПомещения КАК КлючПомещения,
	|	АбонентыПомещения.Абонент КАК Абонент,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ПОМЕСТИТЬ АбонентыПомещенийИДанныеСтроения
	|ИЗ
	|	АбонентыПомещения КАК АбонентыПомещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО АбонентыПомещения.КлючПомещения = энргКлючиПомещений.Ссылка
	|			И (энргКлючиПомещений.Строение = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Организация КАК Организация,
	|	энргСостояниеЛССрезПоследних.Район КАК Район,
	|	энргСостояниеЛССрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ АктивныеАбоненты
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (Организация, Район, Абонент) В
	|					(ВЫБРАТЬ
	|						АбонентыПомещенийИДанныеСтроения.Организация КАК Организация,
	|						АбонентыПомещенийИДанныеСтроения.Район КАК Район,
	|						АбонентыПомещенийИДанныеСтроения.Абонент КАК Абонент
	|					ИЗ
	|						АбонентыПомещенийИДанныеСтроения КАК АбонентыПомещенийИДанныеСтроения)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АбонентыПомещенийИДанныеСтроения.Организация КАК Организация,
	|	АбонентыПомещенийИДанныеСтроения.Район КАК Район,
	|	АбонентыПомещенийИДанныеСтроения.КлючПомещения КАК КлючПомещения,
	|	АбонентыПомещенийИДанныеСтроения.Абонент КАК Абонент,
	|	АбонентыПомещенийИДанныеСтроения.Строение КАК Строение,
	|	АбонентыПомещенийИДанныеСтроения.Помещение КАК Помещение,
	|	АбонентыПомещенийИДанныеСтроения.ЧастныйСектор КАК ЧастныйСектор
	|ПОМЕСТИТЬ АктуальныеАбоненты
	|ИЗ
	|	АбонентыПомещенийИДанныеСтроения КАК АбонентыПомещенийИДанныеСтроения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктивныеАбоненты КАК АктивныеАбоненты
	|		ПО АбонентыПомещенийИДанныеСтроения.Организация = АктивныеАбоненты.Организация
	|			И АбонентыПомещенийИДанныеСтроения.Район = АктивныеАбоненты.Район
	|			И АбонентыПомещенийИДанныеСтроения.Абонент = АктивныеАбоненты.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОтветственныйПИРСрезПоследних.Организация КАК Организация,
	|	бестОтветственныйПИРСрезПоследних.Район КАК Район,
	|	бестОтветственныйПИРСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	бестОтветственныйПИРСрезПоследних.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ОтветственныйПИР
	|ИЗ
	|	РегистрСведений.бестОтветственныйПИР.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (Организация, Район, КлючПомещения) В
	|					(ВЫБРАТЬ
	|						АктуальныеАбоненты.Организация КАК Организация,
	|						АктуальныеАбоненты.Район КАК Район,
	|						АктуальныеАбоненты.КлючПомещения КАК КлючПомещения
	|					ИЗ
	|						АктуальныеАбоненты КАК АктуальныеАбоненты)
	|				И НЕ Ответственный = &ОтветственныйКУстановке
	|				И Ответственный = &ТекущийОтветственный) КАК бестОтветственныйПИРСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеАбоненты.Организация КАК Организация,
	|	АктуальныеАбоненты.Район КАК Район,
	|	АктуальныеАбоненты.КлючПомещения КАК КлючПомещения,
	|	АктуальныеАбоненты.Абонент КАК Абонент,
	|	ОтветственныйПИР.Ответственный КАК Ответственный,
	|	АктуальныеАбоненты.Строение КАК Строение,
	|	АктуальныеАбоненты.Помещение КАК Помещение,
	|	АктуальныеАбоненты.ЧастныйСектор КАК ЧастныйСектор
	|ПОМЕСТИТЬ АктуальныеОтветственные
	|ИЗ
	|	АктуальныеАбоненты КАК АктуальныеАбоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветственныйПИР КАК ОтветственныйПИР
	|		ПО АктуальныеАбоненты.Организация = ОтветственныйПИР.Организация
	|			И АктуальныеАбоненты.Район = ОтветственныйПИР.Район
	|			И АктуальныеАбоненты.КлючПомещения = ОтветственныйПИР.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбонентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	энргАбонентыКонтактнаяИнформация.Значение КАК Значение
	|ПОМЕСТИТЬ АдресАбонентов
	|ИЗ
	|	Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|ГДЕ
	|	энргАбонентыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				АктуальныеОтветственные.Абонент КАК Абонент
	|			ИЗ
	|				АктуальныеОтветственные КАК АктуальныеОтветственные)
	|	И энргАбонентыКонтактнаяИнформация.Тип = &ТипАдреса
	|	И энргАбонентыКонтактнаяИнформация.Вид = &ВидАдреса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеОтветственные.Организация КАК Организация,
	|	АктуальныеОтветственные.Район КАК Район,
	|	АктуальныеОтветственные.КлючПомещения КАК КлючПомещения,
	|	АктуальныеОтветственные.Абонент КАК Абонент,
	|	АктуальныеОтветственные.Ответственный КАК Ответственный,
	|	АктуальныеОтветственные.Строение КАК Строение,
	|	АктуальныеОтветственные.Помещение КАК Помещение,
	|	АктуальныеОтветственные.ЧастныйСектор КАК ЧастныйСектор,
	|	ЕСТЬNULL(АдресАбонентов.Значение, """") КАК АдресСтроенияJSON
	|ИЗ
	|	АктуальныеОтветственные КАК АктуальныеОтветственные
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресАбонентов КАК АдресАбонентов
	|		ПО АктуальныеОтветственные.Абонент = АдресАбонентов.Ссылка";
	
	УстановитьПараметрыЗапроса(Запрос, Отборы);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;	
КонецФункции

Процедура УстановитьПараметрыЗапроса(Запрос, Отборы)
	Запрос.УстановитьПараметр("Период"					, Отборы.Период);
	Запрос.УстановитьПараметр("Организация"				, Отборы.Организация);	
	Запрос.УстановитьПараметр("Район"					, Отборы.Район);
	Запрос.УстановитьПараметр("ОтветственныйКУстановке"	, Отборы.ОтветственныйКУстановке);
	Запрос.УстановитьПараметр("ТипАдреса"				, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидАдреса"				, Справочники.ВидыКонтактнойИнформации.АдресОбъекта);
	
	НеобязательныеОтборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отборы, "НеобязательныеОтборы", Неопределено);
	Если НеобязательныеОтборы = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (энргКлючиПомещений.Строение = &Строение)", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ответственный = &ТекущийОтветственный", "");
		
		Возврат;
	КонецЕсли;
	
	ОтборСтроение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НеобязательныеОтборы, "Строение", Справочники.энргСтроения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Строение", ОтборСтроение);
	Если НЕ ЗначениеЗаполнено(ОтборСтроение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (энргКлючиПомещений.Строение = &Строение)", "");
	КонецЕсли;
	
	ТекущийОтветственный = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НеобязательныеОтборы, "ТекущийОтветственный", Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТекущийОтветственный", ТекущийОтветственный);
	Если НЕ ЗначениеЗаполнено(ТекущийОтветственный) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ответственный = &ТекущийОтветственный", "");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды

Функция ПолучитьСтруктуруОтборов() Экспорт 
	Результат = Новый Структура("Период,Организация,Район,ОтветственныйКУстановке,НеобязательныеОтборы");
	//Результат.Вставить("Период"					, Дата(1,1,1));
	//Результат.Вставить("Организация"			, Справочники.Организации.ПустаяСсылка());	
	//Результат.Вставить("Район"					, Справочники.энргЗоныОтвественности.ПустаяСсылка());
	//Результат.Вставить("ОтветственныйКУстановке"		, Справочники.Пользователи.ПустаяСсылка());
	//Результат.Вставить("НеобязательныеОтборы"	, Неопределено);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСтруктуруНеобязательныхОтборов() Экспорт 
	Результат = Новый Структура("Строение,Улица,НомерДома,НомерКвДо,НомерКвОт,ТекущийОтветственный");
	//Результат.Вставить("Строение"			, Справочники.энргСтроения.ПустаяСсылка());
	//Результат.Вставить("Улица"				, "");	
	//Результат.Вставить("НомерДома"			, 0);
	//Результат.Вставить("НомерКвДо"			, 0);
	//Результат.Вставить("НомерКвОт"			, 0);
	//Результат.Вставить("ТекущийОтветственный"	, Справочники.Пользователи.ПустаяСсылка());
	
	Возврат Результат;
КонецФункции

Функция ПолучитьФильтрПоАдресу(Отборы)
	Результат = Новый Структура;
	НеобязательныеОтборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отборы, "НеобязательныеОтборы", Неопределено);
	Если НеобязательныеОтборы = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат 			= ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(НеобязательныеОтборы);
	УдяляемыеКлючи   = Новый Массив;
	УдяляемыеКлючи.Добавить("Строение");
	УдяляемыеКлючи.Добавить("ТекущийОтветственный");
	
	Для Каждого ТекКлюч из УдяляемыеКлючи Цикл
		Результат.Удалить(ТекКлюч);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
